phys1/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Physics I</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://sandyuraz.com/styles/org.min.css">
</head>
<body>
<div id="content">
<h1 class="title">Physics I
<br />
<span class="subtitle">Sandy's Tutor Notes</span>
</h1>
<p>
Treat the notes here just as a collection of problems over various fields of
physics with detailed solution sets.
</p>

<div id="outline-container-orgcc0adcb" class="outline-2">
<h2 id="orgcc0adcb">Week 1, Feb 8th</h2>
<div class="outline-text-2" id="text-orgcc0adcb">
<p>
Kinematics (linear and rotational, constant and non-constant acceleration).
</p>

<p>
Notes: <a href="./PHSX210G/PHSX210G_02_08.pdf">February 8th</a>
</p>
</div>
</div>

<div id="outline-container-org5ba7c76" class="outline-2">
<h2 id="org5ba7c76">Week 2, Feb 15th</h2>
<div class="outline-text-2" id="text-org5ba7c76">
<p>
Kinematics (linear and rotational, constant and non-constant acceleration).
Energy, energy conservation, and energy-based mechanics .
</p>

<p>
Notes: <a href="./PHSX210B/PHSX210B_02_18.pdf">February 18th</a>, <a href="./PHSX210G/PHSX210G_02_22.pdf">February 22nd</a>
</p>
</div>
</div>

<div id="outline-container-org07a342d" class="outline-2">
<h2 id="org07a342d">Week 3, Feb 22nd</h2>
<div class="outline-text-2" id="text-org07a342d">
<p>
Oscillatory motion.
</p>

<p>
Notes: <a href="./PHSX210B/PHSX210B_02_25.pdf">February 25th</a>
</p>
</div>
</div>

<div id="outline-container-orge045e83" class="outline-2">
<h2 id="orge045e83">Week 4, March 1st</h2>
<div class="outline-text-2" id="text-orge045e83">
<p>
Oscillatory motion.
</p>

<p>
Notes: <a href="./PHSX210G/PHSX210G_03_01.pdf">March 1st</a>, <a href="./PHSX210B/PHSX210B_03_04.pdf">March 4th</a>
</p>
</div>
</div>

<div id="outline-container-org2c26ada" class="outline-2">
<h2 id="org2c26ada">Week 5, March 8th</h2>
<div class="outline-text-2" id="text-org2c26ada">
<p>
Newton’s laws (forces, mechanics, and moving objects).
</p>

<p>
Notes: <a href="./PHSX210G/PHSX210G_03_08.pdf">March 8th</a>, <a href="./PHSX210B/PHSX210B_03_11.pdf">March 11th</a>
</p>
</div>
</div>

<div id="outline-container-org903a8d9" class="outline-2">
<h2 id="org903a8d9">Week 6, March 15th</h2>
<div class="outline-text-2" id="text-org903a8d9">
<p>
Newton’s laws (forces, mechanics, and moving objects).
</p>

<p>
Notes: <a href="./PHSX210G/PHSX210G_03_15.pdf">March 15th</a>, <a href="./PHSX210B/PHSX210B_03_18.pdf">March 18th</a>
</p>
</div>
</div>

<div id="outline-container-orgc4f8b65" class="outline-2">
<h2 id="orgc4f8b65">Week 7, March 22nd</h2>
<div class="outline-text-2" id="text-orgc4f8b65">
<p>
Newton’s laws (forces, mechanics, and moving objects).
Momentum (linear and rotational).
</p>

<p>
Notes: <a href="./PHSX210G/PHSX210G_03_22.pdf">March 22nd</a>, <a href="./PHSX210B/PHSX210B_03_25.pdf">March 25th</a>
</p>
</div>
</div>

<div id="outline-container-org0cb29c1" class="outline-2">
<h2 id="org0cb29c1">Week 8, March 29th</h2>
<div class="outline-text-2" id="text-org0cb29c1">
<p>
Newton’s laws (forces, mechanics, and moving objects).
Momentum (linear and rotational).
</p>

<p>
Notes: <a href="./PHSX210G/PHSX210G_03_29.pdf">March 29th</a>, <a href="./PHSX210B/PHSX210B_04_01.pdf">April 1st</a>
</p>
</div>
</div>

<div id="outline-container-org5cff0d1" class="outline-2">
<h2 id="org5cff0d1">Week 9, April 5th</h2>
<div class="outline-text-2" id="text-org5cff0d1">
<p>
Newton’s laws (forces, mechanics, and moving objects).
</p>

<p>
Notes: <a href="./PHSX210G/PHSX210G_04_05.pdf">April 5th</a>
</p>
</div>
</div>

<div id="outline-container-orge23d469" class="outline-2">
<h2 id="orge23d469">Week 10, April 12th</h2>
<div class="outline-text-2" id="text-orge23d469">
<p>
Newton’s laws (forces, mechanics, and moving objects).
Momentum (linear and rotational).
</p>

<p>
Notes: <a href="./PHSX210G/PHSX210G_04_12.pdf">April 12th</a>
</p>
</div>
</div>

<div id="outline-container-org21f0476" class="outline-2">
<h2 id="org21f0476">Week 11, April 19th</h2>
<div class="outline-text-2" id="text-org21f0476">
<p>
Newton’s laws (forces, mechanics, and moving objects).
Momentum (linear and rotational).
</p>

<p>
Notes: <a href="./PHSX210G/PHSX210G_04_19.pdf">April 19th</a>
</p>
</div>
</div>

<div id="outline-container-orgebdde94" class="outline-2">
<h2 id="orgebdde94">Week 12, April 26th</h2>
<div class="outline-text-2" id="text-orgebdde94">
<p>
Last week of meetings!
</p>

<p>
Notes: <a href="./PHSX210G/PHSX210G_04_26.pdf">April 26th</a>
</p>
</div>
</div>
</div>
</body>
</html>
